#include <RoboCar.h>

RoboCar myCar; // Створити об'єкт RoboCar для керування авто-роботом

int sStart=0;  // Оголосити змінну для збереження даних сенсора старту

void setup() {
     Serial.begin(9600); // Ініціалізація послідовного порта
     myCar.init();       // Ініціалізація задіяних вивводів Arduino Nano та задання кута
}                        // центрального положення передніх коліс за замовчуванням

void loop() {
     sStart=myCar.readStart(); // Зчитати у змінну sStart поточний стан сенсора старту
     Serial.println(sStart);   // Вивести зчитане значення через послідовний порт
     delay(256);
}
