#include <RoboCar.h>

RoboCar myCar; // —творити об'Їкт RoboCar дл€ керуванн€ авто-роботом

void setup() {
     myCar.init(); // ≤н≥ц≥ал≥зац≥€ зад≥€них виввод≥в Arduino Nano та заданн€ кута
}                  // центрального положенн€ передн≥х кол≥с за замовчуванн€м

void loop() {
     myCar.halt(); // «упинити обертанн€ т€гових кол≥с
     delay(2000);

     for(int i=10; i<100; i=i+10){ // «б≥льшувати швидк≥сть обертанн€ т€гових кол≥с, рух ¬ѕ≈–≈ƒ, в≥д 1 до 100% з кроком 10%
         myCar.forward(i);
         delay(2000);
     }
     
     myCar.halt();
     delay(2000);

     for(int i=10; i<100; i=i+10){ // «б≥льшувати швидк≥сть обертанн€ т€гових кол≥с, рух Ќј«јƒ, в≥д 1 до 100% з кроком 10%
         myCar.backward(i);
         delay(2000);
     }
}
