#include <RoboCar.h>

RoboCar myCar; // Створити об'єкт RoboCar для керування авто-роботом

void setup() {
     myCar.init(110); // Ініціалізація задіяних вивводів Arduino Nano та задання кута 
}                     // центрального положення передніх коліс 110 градусів

void loop() {
     myCar.center();  // Позицонувати передні колеса в центральне положення

     for(int i=1; i<=20; i++){ // Повертати передні колеса ВЛІВО від центрального положення на кут від 1 до 20 градусів з кроком 1 градус
         myCar.left(i);
         delay(64);
        }

     for(int i=20; i>=1; i--){
         myCar.left(i);
         delay(64);
        }

     myCar.center();

     for(int i=1; i<=20; i++){ // Повертати передні колеса ВПРАВО від центрального положення на кут від 1 до 20 градусів з кроком 1 градус
         myCar.right(i);
         delay(64);
        }

     for(int i=20; i>=1; i--){
         myCar.right(i);
         delay(64);
        }
}
